Свети мученик Бонифације;1,1
Свети Игњатије Богоносац;2,1
Света мученица Јулијана;3,1
Света великомученица Анастасија;Оци;4,1
Свети Наум охридски;5,1
Света преподобномученица Евгенија;Бадњи дан;6,1
Рождество Христово;Божић;7,1
Сабор Пресвете Богородице;8,1
Свети првомученик и архиЂакон Стефан;9,1
Светих 20 000 мученика Никодијских;10,1
Светих 14 000 младенаца Витлејемских;11,1
Света мученица Анисија;12,1
Преподобни Меланија;13,1
Свети Василије Велики;14,1
Преподобни Сарафим Саровски;15,1
Свети пророк Малахија;16,1
Сабор 70 светих апостола;17,1
Свети Теопемт и Теона;Крстовдан;18,1
Богојављање;19,1
Сабор светог Јована Крститеља;Јовањдан;20,1
Преподобни Георгије Хозевит;21,1
Свети мученик Полиевкт;22,1
Свети Григорије Ниски;23,1
Преподобни Теодосије Велики;24,1
Света мученица Татијана;25,1
Свети мученици Ермило и Стратоник;26,1
Свети Сава, први Архиепископ српски;27,1
Преподобни Павле;28,1
Часне вериге Апостола Петра;29,1
Преподобни Антоније Велики;30,1
Свети Атанасије Велики;31,1
Преподобни Макарије Египатски;1,2
Преподобни Јевтимије Велики;2,2
Преподобни Максим Есповедник;3,2
Свети апостол Тимотеј;4,2
Свети свештеномученик Климент Анкирски;5,2
Преподобна Ксенија Римљанка;6,2
Свети Григорије Богослов;7,2
Преподобни Ксенофонт и Марија;8,2
Пренос моштију светог Јована Златоустог;9,2
Преподобни Јефрем Сирин;10,2
Пренос моштију Игњатија Богоносца;11,2
Света Три Јерарха;12,2
Свети бесребреници Кир и Јован;13,2
Свети мученик Трифун;14,2
Сретење Господње;15,2
Свети Симеон Богопримац и Ана;16,2
Преподобни исидор Пелусиот;17,2
Света мученица Агатија;18,2
Свети Фотије Цариградски;19,2
Свети Партеније Ламсакијски;20,2
Свети Теодор Стратилат;21,2
Свети мученик Никифор;22,2
Свети свештеномученик Харалампије;23,2
Свети свештеномученик Власије;24,2
Свети Мелетије Антиохијски;25,2
Свети Симеон Мироточиви;26,2
Свети Кирил Словенски;27,2
Свети мученици Памфил, Порфирије и други;29,2
Свети великомученик Теодор Тирон;1,3
Свети Лав Римски;2,3
Свети апостоли Архип, Филимон и Апфија;3,3
Свети Лав Катански;4,3
Преподобни Тимотеј;5,3
Свети мученици у Евгенији;6,3
Свети светомученик Поликарп Смирнски;7,3
Прво и друго обретење главе светог Јована Крститеља;8,3
Свети Тарасије Цариградски;9,3
Свети Порфирије;10,3
Преподобни Прокопије Декаполит;11,3
Преподобни Василије Исповедник;12,3
Преподобни Јован Касиан;13,3
Света преподобномученика Евдокија;14,3
Свети свештеномученик Теодор Киринејски;15,3
Свети мученици Евтропије;16,3
Преподобни Терасим Јордански;17,3
Свети мученик Конон;18,3
Света 42 мученика Аморејска;19,3
Светих седам свештеномученика Херсконских;20,3
Свети Теофилакт Исповедник;21,3
Светих 40 мученика Севастијских;Младенци;22,3
Свети мученик Кодрат Коринтски;23,3
Свети Софроније Јерусалимски;24,3
Преподобни Симеон Нови Богослов;25,3
Пренос моштију свети Никифора Цариградског;26,3
Преподобни Венедикт Нурсијски;27,3
Свети мученици Агапије, Пласије и други;28,3
Свети Апостол Аристовул;29,3
Свети Алексије Човек Божји;30,3
Свети Кирил Јерусалимски;31,3
Свети мученици Хризант, Дарија и други;1,4
Преподобни Оци побијени у манастију Свети Саве Освећеног;2,4
Лазарева субота;Врбица;3,4
Улазак Господа Исуса Христа у Јерусалим;Цвети;4,4
Свети преподобномученик Никон и други;5,4
Преподобни Захарије;6,4
Благовести;7,4
Велики четвртак (Велико бденије);8,4
Велики петак;9,4
Велика субота;10,4
Васкрсење Господа исуса Христа;ВАСКРС;11,4
Васкрски понедељак;12,4
Васкрсни уторак;13,4
Преподобна Марија Египћанка;14,4
Преподобни Тит Чудотворац;15,4
Преподобни Никита Исповедник;16,4
Преподобни Јосиф Химнограф;17,4
Свети мученици Агатопод и Теодул;18,4
Свети Евтијије Цариградски;19,4
Преподобни Георгије Митиленски;20,4
Свети апостоли Иродион, Агав, Руф и други;21,4
Свети мученик Евпсихије;22,4
Свети мученик Терентије;23,4
Свети свештеномученик Антипа;24,4
Преподобни Василије Исповедник;25,4
Свети свештеномученик Артемон Лаодикијски;26,4
Свети Мартин Исповедник;27,4
Свети апостоли Аристарх, Пуд и Трофим;28,4
Свете мученице Агапија, Хионија и Ирина;29,4
Свети свештеномученик Симеон Персијски;30,4
Преподобни Јован;1,5
Преподобни Јован Ветхопешчерник;2,5
Преподобни Теодор;3,5
Свети свештеномученик Јануарије;4,5
Преподобни Теодор Сикеот;5,5
Свети великомученик Георгије;ЂурЂевдан;6,5
Свети Сава Стратилат;7,5
Свети апостол и јеванЂелист Марко;Марковдан;8,5
Свети свештеномученик Василије Амасијски;9,5
Спаљење моштију Светог Саве на Врачару;10,5
Свети апостоли Јасон и Сосипатр;11,5
Свети Василије Острошки Чудотворац;12,5
Свети апостол Јаков Заведејев;13,5
Свети пророк Јеремија;14,5
Свети Атанасије Велики;15,5
Свети мученици Тимотеј и Мавра;16,5
Света мученица Пелагија Тарсијска;17,5
Света великомученица Ирина;18,5
Праведни Јов;19,5
Вазнесење Господње;Спасовдан;20,5
Свети апостол и јеванЂелист Јован Богослов;21,5
Пренос моштију светог Николе;22,5
Преподобни Симон Зилот;23,5
Свети Кирило и Методије;24,5
Свети Епифаније;25,5
Света мученица Гликерија;26,5
Свети мученик Исидор;27,5
Преподобни Памохије Велики;28,5
Преподобни Теодор;29,5
Силазак Светог Духа на апостоле-Педесетница-Тројице;30,5
Духовски понедељак;31,5
Духовски уторак;1,6
Свети мученик Талалеј;2,6
Свети цар Константин и царица Јелена;3,6
Свети мученик Јован Владимир;4,6
Преподобни Михаило Исповедник;5,6
Преподобни Симеон Дивногорац;6,6
Треће обретење главе Светог Јована Крститеља;7,6
Свети апостоли Карп и Алфеј;8,6
Свети свештеномученик Терапонт;9,6
Преподобни Никита Исповедник;10,6
Преподобнаомученица Теодосија Тирска;11,6
Преподобни Исакије Далматски;12,6
Свети апостол Јерма;13,6
Свети мученик Јустин Философ;14,6
Свети Никифор;15,6
Свети мученик Лукилијан и други с њим;16,6
Мироточиви Марта и Марија;17,6
Свештеномученик Доротеј;18,6
Преподобни Васарион;19,6
Свети мученик Теодот Анкирски;20,6
Свети великомученик Теодор Стратилат;21,6
Свети Кирило Александријски;22,6
Свети свештеномученик Тимотеј Пруски;23,6
Свети апостоли Вартоломеј и Варнава;24,6
Преподобни Онуфрује Велики;25,6
Света мученица Акилина;26,6
Свети пророк Јелисеј;27,6
Свети Кнез Лазар;28,6
Свети Тихон Аматунтски Чудотворац;29,6
Свети мученици Мануил, Савел и Исмаил;30,6
Свети мученици Леонтије, ТЕодул и Ипатије;1,7
Свети апостол Јуда;2,7
Свети свештеномученик Методије;3,7
Свети мученик Јулијан Тарсијски;4,7
Свети свештеномученик Јевсевије;5,7
Света мученица Агрипина;6,7
РоЂење светог Јована Претече;Ивањдан;7,7
Света преподобномученица Февронија;8,7
Преподобни Давид Солунски;9,7
Преподобни Сампсон Странопримац;10,7
Пренос моштију светих бесребреника Кира и Јована;11,7
Свети апостоли Петар и Павле;Петровдан;12,7
Сабор светих дванаест апостола;Павловдан;13,7
Свети мученици  Козма и Дамјан;14,7
Полагање ризе Пресвете Богородице;15,7
Свети мученик Јакинт, преподобни Анатолије;16,7
Свети Андреј Критски;17,7
Преподобни Атанасије Атонски;18,7
Преподобни Сисоје Велики;19,7
Преподобни Тома Малеин;20,7
Свети великомученик Прокопије;21,7
Свети свештеномученик Панкратије, свети Теодор;22,7
Светих 45 мученика из Никопоља;23,7
Света великомученица Јефимија;24,7
Свети мученици Прокло и Иларије;25,7
Сабор светог архангела Гаврила;26,7
Свети апостол Акила, преподобни Никодим;27,7
Свети мученици Кирик и Јулита;28,7
Свети свештеномученик Атиноген;29,7
Света великомученица Марина;Огњена Марија;30,7
Свети мученик Емилијан;31,7
Свети Стефан (Лазаревић) и мајка му Евгенија;1,8
Свети пророк Илија;Илиндан;2,8
Свети пророк Језекиљ;3,8
Света Марија Магдалина;Блага Марија;4,8
Свети мученици Трофим, Теофил и други с њима;5,8
Света мученица Христина;6,8
Успеније Свете Ане;7,8
Препмученица Параскева (Трнова);8,8
Свети великомучник Пантелејмон;9,8
Свети апостоли и Ђакони Никанор, Прохор, Тимој и Пармен;10,8
Свети мученик Калиник, света мученица Серафима;11,8
Преподобна мати Ангелина Српска (Госпојинске покладе);12,8
Свети мученик Евдоким, свети мученица Јулита (почетак поста);13,8
Изношење Часног Крста;Макавеји;14,8
Пренос моштију свети првомученика и архиЂакона Срефана;15,8
Преподобни Исакије, Далмат и Фауст;16,8
Светих седам мученика у Ефесу;17,8
Свети мученик Евсигније;18,8
Преображење Господње;19,8
Свети преподобномученик Дометије;20,8
Свети Емилијан Исповедник;21,8
Свети апостол Матија, свети мученик Антоније;22,8
Свети мученик и архиЂакон Лаврентије;23,8
Свети мученик и архиЂакон Евпло;24,8
Свети мученици Фотије, Аникита и други с њима;25,8
Свети мученик Иполит (Оданије Преображења);26,8
Свети пророк Михеј (Претпразништво Успенија);27,8
Успење Пресвете Богородице;28,8
Свети Јевспатије, преподобни Роман, Рафаило Банатски;29,8
Свети мученици Мирон и Патрокло;30,8
Свети мученик Флор, преподобни Јован Рилски;31,8
Свети мученик Андреј Стратилат;1,9
Свети пророк Самуило, свештеномученик Филим Ираклијски;2,9
Апостол Тадеј, мученик Васа са децом;3,9
Свети мученик Агатоник;4,9
Свети мученик Луп;5,9
Свети свештмученик Евтихије, света мученица Сара;6,9
Пренос моштију светог апостола Вартоломеја, свети апостол Тит;7,9
Свети мученици Адријан и Наталија;8,9
Преподобни Пимен Велики;9,9
Преподобни Мојсеј Мурин, Сава Псковски;10,9
Усековање главе светог Јована Крститеља;11,9
Свети Александар Невски;12,9
Полагање појаса Пресвете Богородице;13,9
Симеон Столпник;црквена Нова Година;14,9
Свети мученик Мамант, свети Јова Постник;15,9
Свети свештмученик Антим;16,9
Свештмученик Вавила, пророк Мојсеј Боговидац;17,9
Свети пророк Захарија и праведна Јелисавета;18,9
Чудо светог архангела Мијаила, свети мученик Евдоксије;19,9
Свети мученик Созонт (Претпразништво рождества Пресвете Богородице);20,9
РоЂење Пресвете Богородице;Мала Госпојина;21,9
Свети праведни Јоаким и Ана;22,9
Свете мученице Минодора, Митродора и Нимфодора;23,9
Преподобна Теодора, преподобни Сергије и Герман;24,9
Свети свештмученик Автоном;25,9
Свети свештеномученик Корнилије;26,9
Воздвижење Часног Крста;Крстовдан;27,9
Свети великомученик Никита;28,9
Преподобни Доротеј и Кипријан;29,9
Свете мученице Вера, Нада и љубав и мати им Софија;30,9
Свети Евменије Гортински, света мученица Ариадна;1,10
Свети мученици Трофим, Саватије и Доримедонт;2,10
Свети великомученик Јевстатије;3,10
Свети апостол Кодрат (Оданије Воздвижења);4,10
Свети свештеномученик Фока, свети Јона;5,10
Зачеће светог Јована Претече и Крститеља;6,10
Света првомученица Текла;7,10
Преподобна Ефросиније, свети Сергије Радоњешки;8,10
Свети апостол и јеванЂелист Јован Богослов;Задушнице;9,10
Свети мученик Калистрат;10,10
Преподобни Харитон Исповедник;11,10
Преподобни Киријак Отшелник;Михољдан;12,10
Свети свештеномученик Григорије;13,10
Покров Пресвете Богородице;14,10
Свети свештеномученик Кипријан, преподобни Андреј;15,10
Свети свештеномученик Дионисије Ареопагит;16,10
Свети Стефан и Јелена (Штиљановић);17,10
Света мученица Харитина, свештеномученик Дионасије;18,10
Свети апостол Тома;Томиндан;19,10
Свети мученици Сергије и Вакхо;СрЂевдан;20,10
Преподобна Пелагија и преподобна Таиса;21,10
Свети апостол Јаков, свети Стефан Српски (Слепи);22,10
Свети мученици Евлампије и Евлампија;23,10
Свети апостол Филип, свети Теофан Начертани;24,10
Свети мученици Андроник, Пров и Тарах;25,10
Свети мученик Карп, света мученица Злата Магленска;26,10
Преподобна мати Параскева;Света Петка;Петковдан;27,10
Свети свештеномученик Лукијан, преподобни Јевтимије;28,10
Свети мученик Лонгин Сотник;29,10
Свети пророк Осија, преподобномученик Андреј Критски;30,10
Свети апостол и јеванЂелист Лука;31,10
Свети пророк Јоил;1,11
Свети великомученик Артемије;2,11
Преподобни Иларион;3,11
Свети равноапостолни Аверкије Јаропољски;4,11
Свети апостол Јаков, први епископ јерусалимски;5,11
Свети великомученик Арета;Задушнице;6,11
Свети мученици Маркијан и Мартирије;7,11
Свети великомученик Димитрије;Митровдан;8,11
Свети мученик Нестор;9,11
Свети мученик Терентије;10,11
Свети Аврамије Затворник;11,11
Свети краљ Милутин, Теоктист и мати им Јелена;12,11
Свети апостоли Стахије, Амплије и други с њим;13,11
Свети Козма и Дамјан;Врачеви;14,11
Свети мученици Акиндин, Пигасије и други с њима;15,11
Обновљење храма светог Георгија;ЂурЂиц;16,11
Преподобни Јоаникије Велики, свештеномученик Никандар;17,11
Свети преподобномученици Галиктион и Епистима;18,11
Свети Павле Исповедник, преподобни Варлам Хутински;19,11
Света 33 мученика у Мелитини, преподобни Лазар;20,11
Сабор светог Архангела Михајла;АранЂеловдан;21,11
Свети мученик Онисифор и Порфириије, свети Нектарије Егински;22,11
Свети апостоли Олимп, Ераст, Родион и други с њима;23,11
Свети краљ Стефан Дечански;Мратиндан;24,11
Свети Јован Милостиви;25,11
Свети Јован Златоусти;26,11
Свети апостол Филип (Божићне покладе);27,11
Свети мученици Гурије, Само и Авив;28,11
Свети апостол и јеваЂелист Матеј;29,11
Свети Григорије Чудотворац, Никон Родоњешки;30,11
Свети мученици Платон, Роман Варул Отрок;1,12
Свети пророк Авдија, мученик Варлаам, преподобни Јосаф;2,12
Преподобни Григорије Декаполит;3,12
Ваведење Пресвете Богородице;4,12
Свети апостоли Филимон, Апфија и Архип;5,12
Свети Амфилохије Иконијски, свети Григорије;6,12
Света великомученица Екатарина;7,12
Свети свештеномученик Климент;8,12
Преподобни Алимпије Столпник;9,12
Свети мученик Јаков Персијанац, свети аков Ростовски;10,12
Свети преподобномученик Стефан;11,12
Свети мученици Парамон и Филумен;12,12
Свети апостол Андреј Првозвани;13,12
Свети пророк Наум, свети Филарет Милостиви;14,12
Свети цар Урош, преподобни Јоаникије Девички;15,12
Свети пророк Софонија, преподобни Јован Ћутљиви;16,12
Света великомученица Варвара;17,12
Преподобни Сава Освечћени;18,12
Свети Никола;Никољдан;19,12
Свети Амвросије, преподобни Григорије Горњачки;20,12
Преподобни Патапоје, свети апостоли Состен, Апалос и други;21,12
Зачеће свете Ане;22,12
Свети мученици Мина и други, свети Јован Деспот Српски;23,12
Преподобни Данило Столпник;24,12
Преподобни Спиридон Чудотворац;25,12
Светимученик Евстратије, свети Гаврило и Никодим Српски;26,12
Свети мученик Тирс, Левкије, Филимон, Аполоније и други;27,12
Свети свештеномученик Елевтерије, преподобни Павле;28,12
Свети пророк Агеј, света Теофанија царица;29,12
Свети пророк Данило, свети проподобномученик Ђакон Авакум;30,12
Свети мученик Севастијан, свети Модест и други с њим;31,12
